In [14]:
# Import dependencies

import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine, MetaData, Table
from config import password
import psycopg2

In [16]:
path = f"postgresql://postgres:{password}@localhost:5432/sql-homework"
engine = create_engine(path)
conn=engine.connect()

In [18]:
employee_data = pd.read_sql("SELECT * FROM employees", conn)

In [19]:
employee_data.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.

In [ ]:
# Create a bar chart of average salary by title.